import os

names = {'பூபதி': ["பச்சை"],
         'ராஜாமணி': ["அரளி", "செண்டுமல்லி"],
         'அசோக் ': ["அரளி", "வெள்ளைஅரளி"],
         'சிவகாமி': ["அரளி"],
         'ராமமூர்த்தி': ["அரளி"],
         'குமார்': ["சம்பங்கி", "செண்டுமல்லி"],
         'முத்துகிருஷ்ணன்': ["சம்பங்கி"],
         #'செளந்தர்ராஜன்': ["சம்பங்கி"],
         'சண்முகவேல் ': ["செண்டுமல்லி", "முல்லை", "கனகாம்பரம்"],
         'கண்ணன்': ["முல்லை"],
         'ரவிச்சந்திரன்': ["கனகாம்பரம்", "முல்லை", "மல்லிகை"],
         'சந்தனமுருகன்': ["முல்லை"],
         'அழகுசந்தனம் ': ["மல்லிகை", 'முல்லை'],
         'தங்கவேல் ': ["முல்லை", "கனகாம்பரம்"],
         'கிஷோர்': ["பிச்சி", "முல்லை", "கனகாம்பரம்"],
         'பெரியண்ணன்': ["செண்டுமல்லி", "பிச்சி", "வெள்ளைபிச்சி", "முல்லை", "கனகாம்பரம்", "மல்லிகை"],
         'PK': ["கனகாம்பரம்", "முல்லை"],
         'அழகு': ["முல்லை"],
         'பூசாரி': ["முல்லை"],
         'சின்னமருதன்': ["பிச்சி", "மல்லிகை"],
         'அடைக்கலம்': ["மல்லிகை"],
         'தங்கமருதன்': ["வெள்ளைபிச்சி", "முல்லை", "பிச்சி"],
         'இ. மருதன்': ["பிச்சி"],
         'மகாராணி ': ["மல்லிகை", "முல்லை"],
         'அழகுமலை': ["முல்லை"],
         'கருப்பசாமி': ["முல்லை"],
         'கிருஷ்ணமூர்த்தி': ["முல்லை"],
         'அழகுலட்சுமி': ["முல்லை"],
         'உடையார்': ["முல்லை"],
         'ஆண்டிச்சி': ["பிச்சி"],
         'பூமி': ["முல்லை"],
         'அழகுராஜா': ["முல்லை"],
         'மலையரசன் ': ["முல்லை", "மல்லிகை"],
         'பெரியமருது': ["முல்லை", "செண்டுமல்லி"],
         'அன்புமணி': ["மல்லிகை", "முல்லை"],
         'வள்ளி': ["முல்லை"],
         'ஜெகஜோதி': ["பிச்சி", "மல்லிகை"],
         'ஜெயபாரதி': ["மல்லிகை"],
         'RR': ["பிச்சி", "முல்லை", "மல்லிகை"],
         'சந்தனம்': ["பிச்சி", "மல்லிகை"],
         'சிவசக்தி': ["முல்லை", "மல்லிகை"],
         'அனுஸ்குமார்': ["மல்லிகை", "முல்லை"],
         'மணி': ["முல்லை"],
         'கண்ணித்தாய்': ["முல்லை"],
         'மலைக்குமரன்': ["மல்லிகை"],
         'பால்ராஜ்': ["மல்லிகை"],
         'குமரேசன்': ["கனகாம்பரம்"],
         'துர்காதேவி': [""],
         'மணிகண்டண்': ["மல்லிகை"],
         'பூ உமா': ["முல்லை"],
         'ஜெயமுருகன்': ["மல்லிகை", "முல்லை"],
         'J. குமரன்': ["மல்லிகை"],
         'சங்கீதா': ["முல்லை"],
         'கவியரசன்': ["முல்லை"],
         'ராமன்': ["முல்லை"],
         'லட்சுமி': ['முல்லை', 'பிச்சி'],
         'பாண்டியராஜன்': ['மல்லிகை'],
         'அனுஷ்டிகா': ["மல்லிகை", "பிச்சி"],
         'அழகுமீனாட்சி': ['மல்லிகை'],
         'அனுஷ்கா': ['முல்லை'],
         'தர்மராஜ்': ["செண்டுமல்லி"],
         'ரக்சிதா': ["முல்லை"],
         'பொன்னம்மாள்': ["முல்லை"],
         'நாகலட்சுமி': ["முல்லை", "மல்லிகை", "கனகாம்பரம்"],
         'அட்சிகா ஸ்ரீ': ["முல்லை","வெள்ளைபிச்சி"],
         'வீரபாண்டி': ["முல்லை"],
         'விஸ்வா': ["முல்லை", 'மல்லிகை', 'டிங்டாங்'],
         'பாலமுருகன்': ['டிங்டாங்'],
         'வெற்றிவேல்முருகன்': ['மல்லிகை'],
         'VM': [''],
         'முருகதேவி': ["முல்லை"],
         'பழனிகுமார்': ["முல்லை", "மல்லிகை"],
         'சேகர்': ["மல்லிகை"],
         'அழகுபிரியா': ["முல்லை"],
         'சஞ்சீவி': ["டிங்டாங்"],
         'தவமணி': ["முல்லை"],
         'இளவரசி': ["முல்லை"],
         'Empty Sheet': ['']}

months = ["ஜனவரி", "பிப்ரவரி", "மார்ச்", "ஏப்ரல்", "மே", "ஜூன்", "ஜூலை", "ஆகஸ்ட்", "செப்டம்பர்", "அக்டோபர்", "நவம்பர்",
          "டிசம்பர்"]

days = [0, 3, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0]

years = [2023, 2024, 2025, 2026, 2027, 2028, 2029, 2030]

name_list = list(names.keys())


def getlist():
    dir_path = "D:\\Billing\\Work_Here\\montly sheets"
    lis_files = []
    for path in os.listdir(dir_path):
        if os.path.isfile(os.path.join(dir_path, path)):
            lis_files.append(path)
    return lis_files
